<head>
<link type="text/css" rel="stylesheet" href="main.css">
</head>
<center>
<?php
require_once "nav.php";
$firstname = $_POST['firstname'];
$lastname = $_POST['lastname'];
$age = $_POST['age'];
$height = $_POST['height'] / 100;
$weight = $_POST['weight'];
$date = new DateTime();

$bmi = round($weight/pow($height, 2), 2);

echo $firstname." ".$lastname." ".$age." "."Date"." ".$date->format("d-m-Y H:i:s")."<br>" ;
$result = "ดัชนีมวลกาย = <span>" . $bmi . "</span>";

if ($bmi >= 40) {
	$result .= " <b>โรคอ้วนขั้นสูงสุด</b>";
} else if ($bmi >= 35) {
	$result .= " <b>โรคอ้วนระดับ2</b> <br>คุณเสี่ยงต่อการเกิดโรคที่มากับความอ้วน หากคุณมีเส้นรอบเอวมากกว่าเกณฑ์ปกติคุณจะเสี่ยงต่อการเกิดโรคสูง คุณต้องควบคุมอาหาร และออกกำลังกายอย่างจริงจัง";
} else if ($bmi >= 28.5) {
	$result .= " <b>โรคอ้วนระดับ1</b> <br>และหากคุณมีเส้นรอบเอวมากกว่า 90 ซม.(ชาย) 80 ซม.(หญิง) คุณจะมีโอกาศเกิดโรคความดัน เบาหวานสูง จำเป็นต้องควบคุมอาหาร และออกกำลังกาย";
} else if ($bmi >= 23.5) {
	$result .= " <b>น้ำหนักเกิน</b> <br>หากคุณมีกรรมพันธ์เป็นโรคเบาหวานหรือไขมันในเลือดสูงต้องพยายามลดน้ำหนักให้ดัชนีมวลกายต่ำกว่า 23";
} else if ($bmi >= 18.5) {
	$result .= " <b>น้ำหนักปกติ</b> <br>และมีปริมาณไขมันอยู่ในเกณฑ์ปกติ มักจะไม่ค่อยมีโรคร้าย อุบัติการณ์ของโรคเบาหวาน ความดันโลหิตสูงต่ำกว่าผู้ที่อ้วนกว่านี้";
} else {
	$result .= " <b>น้ำหนักน้อยเกินไป</b> <br>ซึ่งอาจจะเกิดจากนักกีฬาที่ออกกำลังกายมาก และได้รับสารอาหารไม่เพียงพอ วิธีแก้ไขต้องรับประทานอาหารที่มีคุณภาพ และมีปริมาณพลังงานเพียงพอ และออกกำลังกายอย่างเหมาะสม";
}

echo $result;


?>	
</center>
